Repository: KryptonGao/StudyPulse
Catalog: StudyPulse/Localizable.xcstrings
Source language: en
Languages: ja, ko, zh_hans, zh_hant

source: Creative Commons Attribution-NonCommercial-ShareAlike 4.0 International
ja: クリエイティブ・コモンズ 表示-非営利-継承 4.0 国際ライセンス
ko: 크리에이티브 커먼즈 저작자표시-비영리-동일조건변경허락 4.0 국제 라이선스
zh_hans: 知识共享署名-非商业性使用-相同方式共享 4.0 国际许可协议
zh_hant: 創用 CC 姓名標示-非商業性-相同方式分享 4.0 國際授權條款

source: Current analysis
ja: 現在の分析
ko: 현재 분석
zh_hans: 当前分析
zh_hant: 目前分析

source: Current Streak
ja: 現在のストリーク
ko: 현재 스트릭
zh_hans: 当前连续
zh_hant: 當前連續

source: Currently StudyPulse stores data locally on each device and does not support iCloud sync. Data backup and transfer between devices must be done manually via CSV export-import or by copying the Documents folder. Cross-device sync is a planned feature for a future update.
ja: 現在、StudyPulseは各端末にローカル保存され、iCloud同期には対応していません。端末間のデータバックアップと転送は、CSVのエクスポート・インポート、またはDocumentsフォルダのコピーで手動で行う必要があります。複数端末間の同期は将来のアップデートで計画されています。
ko: 현재 StudyPulse는 각 기기에 데이터를 로컬로 저장하며 iCloud 동기화를 지원하지 않습니다. 기기 간 데이터 백업 및 전송은 CSV 내보내기-가져오기 또는 Documents 폴더 복사를 통해 수동으로 수행해야 합니다. 기기 간 동기화는 향후 업데이트에서 계획된 기능입니다.
zh_hans: 目前 StudyPulse 将数据存储在每个设备的本地，不支持 iCloud 同步。设备间的数据备份和传输需要通过 CSV 导出‑导入或复制 Documents 文件夹手动完成。跨设备同步是未来版本计划中的功能。
zh_hant: 目前 StudyPulse 將數據存儲在每個裝置的本地，不支援 iCloud 同步。裝置間的數據備份和傳輸需要通過 CSV 匯出‑匯入或複製 Documents 文件夾手動完成。跨裝置同步是未來版本計劃中的功能。

source: Custom
ja: カスタム
ko: 사용자 정의
zh_hans: 自定义
zh_hant: 自訂

source: Custom Duration
ja: カスタム時間
ko: 사용자 지정 시간
zh_hans: 自定义时长
zh_hant: 自定義時長

source: Customize the look, language, home dashboard layout and widget data.
ja: 外観、言語、ホーム画面レイアウト、ウィジェットデータをカスタマイズします。
ko: 외관, 언어, 홈 대시보드 레이아웃과 위젯 데이터를 사용자 지정합니다.
zh_hans: 自定义外观、语言、主页仪表盘布局与小组件数据。
zh_hant: 自訂外觀、語言、主頁儀表板佈局與小工具資料。

source: Cyan
ja: シアン
ko: 시안
zh_hans: 青色
zh_hant: 青色

source: Daily Best-Window Notification
ja: 毎日の最適時間通知
ko: 매일 최적 시간 알림
zh_hans: 每日最佳窗口通知
zh_hant: 每日最佳時段通知

source: Daily Goals
ja: 毎日の目標
ko: 매일 목표
zh_hans: 每日目标
zh_hant: 每日目標

source: Daily Goals Reminder
ja: 毎日の目標リマインダー
ko: 매일 목표 알림
zh_hans: 每日目标提醒
zh_hant: 每日目標提醒

source: Daily Inspiration
ja: 今日の一言
ko: 오늘의 동기부여
zh_hans: 每日励志
zh_hant: 每日勵志

source: Daily minutes: %d
ja: 1日の学習時間：%d分
ko: 일일 학습 시간: %d분
zh_hans: 每日分钟数：%d
zh_hant: 每日分鐘數：%d

source: Daily Quote
ja: 今日の名言
ko: 오늘의 명언
zh_hans: 每日格言
zh_hant: 每日格言

source: Daily Reminder
ja: 毎日のリマインダー
ko: 매일 알림
zh_hans: 每日提醒
zh_hant: 每日提醒

source: Daily study diary with mood and energy tags. Syncs to Apple Health Mindful Session.
ja: 毎日の学習日記。気分とエネルギータグ付き。Appleヘルスのマインドフルセッションに同期。
ko: 매일 학습 일기. 기분 및 에너지 태그 포함. Apple 건강 마음챙김 세션에 동기화.
zh_hans: 每日学习日记,含心情和精力标签。同步到 Apple 健康正念。
zh_hant: 每日學習日記,含心情和精力標籤。同步到 Apple 健康正念。

source: DANGER
ja: 危険
ko: 위험
zh_hans: 危险
zh_hant: 危險

source: Danger Zone
ja: 危険ゾーン
ko: 위험 구역
zh_hans: 危险区域
zh_hant: 危險區域

source: Dark
ja: ダーク
ko: 다크
zh_hans: 深色
zh_hant: 深色

source: Dashboard
ja: ダッシュボード
ko: 대시보드
zh_hans: 数据概览
zh_hant: 資料總覽

source: Data + Suggestion
ja: データ + 提案
ko: 데이터 + 제안
zh_hans: 数据 + 建议
zh_hant: 資料 + 建議

source: Data Admin
ja: データ管理
ko: 데이터 관리
zh_hans: 数据管理
zh_hant: 資料管理

source: Data exported successfully!
ja: データのエクスポートに成功しました！
ko: 데이터 내보내기 성공!
zh_hans: 数据导出成功！
zh_hant: 資料匯出成功！

source: Data exported to: %@
ja: データがエクスポートされました：%@
ko: 데이터가 내보내졌습니다: %@
zh_hans: 数据已导出至：%@
zh_hant: 資料已匯出至：%@

source: Data imported successfully!
ja: データのインポートに成功しました！
ko: 데이터 가져오기 성공!
zh_hans: 数据导入成功！
zh_hant: 資料匯入成功！

source: Data Management
ja: データ管理
ko: 데이터 관리
zh_hans: 数据管理
zh_hant: 資料管理

source: Date
ja: 日付
ko: 날짜
zh_hans: 日期
zh_hant: 日期

source: Day %d
ja: %d 日目
ko: %d일차
zh_hans: 第 %d 天
zh_hant: 第 %d 天

source: Day %d/%d
ja: %d/%d 日目
ko: %d/%d일차
zh_hans: 第 %d/%d 天
zh_hant: 第 %d/%d 天

source: days ago
ja: 日前
ko: 일 전
zh_hans: 天前
zh_hant: 天前

source: Days Remaining
ja: 残り日数
ko: 남은 일수
zh_hans: 剩余天数
zh_hant: 剩餘天數

source: Days Until Due
ja: 締切まで
ko: 마감까지
zh_hans: 距离截止
zh_hant: 距離截止

source: DEBUG Override
ja: DEBUG 上書き
ko: DEBUG 재정의
zh_hant: DEBUG 覆寫

# DEBUG 自定义系统提示:已生效(完全替换默认 + appendix)
source: DEBUG override is ACTIVE — replaces the default system + appendix.
ja: DEBUG 上書き: 有効 (デフォルト + appendix を完全置換)
ko: DEBUG 재정의: 활성 (기본 + appendix 완전 대체)
zh_hans: DEBUG 自定义系统提示:已生效(完全替换默认 + appendix)
zh_hant: DEBUG 自訂系統提示:已生效(完全替換預設 + appendix)

# DEBUG 自定义系统提示:未设置(回退到默认 + appendix)
source: DEBUG override is empty — falls back to default + appendix.
ja: DEBUG 上書き: 未設定 (デフォルト + appendix にフォールバック)
ko: DEBUG 재정의: 비어 있음 (기본 + appendix 로 폴백)
zh_hans: DEBUG 自定义系统提示:未设置(回退到默认 + appendix)
zh_hant: DEBUG 自訂系統提示:未設定(回退到預設 + appendix)

source: DEBUG: Override System Prompt
ja: DEBUG: システムプロンプト上書き
ko: DEBUG: 시스템 프롬프트 재정의
zh_hant: DEBUG: 覆寫系統提示

# debug.buildInfo
source: Build Info
ja: ビルド情報
ko: 빌드 정보
zh_hans: 构建信息
zh_hant: 組建資訊

# debug.clearLogs
source: Clear In-Memory Logs
ja: メモリログを消去
ko: 메모리 로그 지우기
zh_hans: 清空内存日志
zh_hant: 清空記憶體日誌

# debug.clearLogsConfirm
source: Clear all 5000 in-memory log entries? Already-exported logs are not affected.
ja: 5000 件のメモリログをすべて消去しますか？既にエクスポートされたログは影響を受けません。
ko: 5000개의 메모리 로그를 모두 지우시겠습니까? 이미 내보낸 로그는 영향을 받지 않습니다.
zh_hans: 清空全部 5000 条内存日志？已导出的日志不受影响。
zh_hant: 清空全部 5000 條記憶體日誌？已匯出的日誌不受影響。

# debug.diagnostics
source: Diagnostics
ja: 診断
ko: 진단
zh_hans: 诊断
zh_hant: 診斷

# debug.entityCounts
source: Entity Counts
ja: エンティティ件数
ko: 엔티티 수
zh_hans: 实体记录数
zh_hant: 實體記錄數

# debug.experiments
source: Experiments
ja: 実験的機能
ko: 실험적 기능
zh_hans: 实验性功能
zh_hant: 實驗性功能

# debug.forceWidgetReload
source: Force Widget Reload
ja: ウィジェットを強制更新
ko: 위젯 강제 새로 고침
zh_hans: 强制刷新小组件
zh_hant: 強制重載小工具

# debug.fpsOverlay
source: FPS / Memory Overlay
ja: FPS / メモリ オーバーレイ
ko: FPS / 메모리 오버레이
zh_hans: FPS / 内存浮窗
zh_hant: FPS / 記憶體浮窗

# debug.inspect.title
source: Inspect
ja: 検査
ko: 검사
zh_hans: 检视
zh_hant: 檢視

# debug.lagCount5min
source: Lags (5 min)
ja: 5 分間のカクつき
ko: 5분 지연
zh_hans: 5 分钟卡顿
zh_hant: 5 分鐘卡頓

# debug.lastLag
source: Last Lag
ja: 直近のカクつき
ko: 최근 지연
zh_hans: 最近卡顿
zh_hant: 最近卡頓

# debug.layoutBounds
source: Layout Bounds
ja: Layout Bounds デバッグ
ko: Layout Bounds 디버그
zh_hans: Layout Bounds 调试
zh_hant: Layout Bounds 偵錯

# debug.logViewer
source: Log Viewer
ja: ログビューア
ko: 로그 뷰어
zh_hans: 日志查看器
zh_hant: 日誌檢視器

# debug.longPressInspect
source: Long-press Inspect
ja: 長押しで値を検査
ko: 길게 눌러 원시 값 검사
zh_hans: 长按检视原始值
zh_hant: 長按檢視原始值

# debug.maintenance
source: Maintenance
ja: メンテナンス
ko: 유지보수
zh_hans: 维护
zh_hant: 維護

# debug.masterToggle
source: Enable Debug Mode
ja: Debug モードを有効化
ko: Debug 모드 활성화
zh_hans: 启用 Debug 模式
zh_hant: 啟用 Debug 模式

# debug.masterToggleDesc
source: Show the yellow banner and unlock the sub-toggles below.
ja: 黄色いバナーを表示し、下のサブトグルを解放します。
ko: 노란색 배너를 표시하고 아래 하위 토글을 해제합니다.
zh_hans: 显示黄色 banner 并解锁下方子开关。
zh_hant: 顯示黃色 banner 並解鎖下方子開關。

# debug.memory
source: Memory
ja: メモリ
ko: 메모리
zh_hans: 内存
zh_hant: 記憶體

# debug.openConsole
source: Open Debug Console
ja: Debug コンソールを開く
ko: Debug 콘솔 열기
zh_hans: 打开 Debug 控制台
zh_hant: 開啟 Debug 主控台

# debug.performancePanel
source: Performance Panel
ja: パフォーマンスパネル
ko: 성능 패널
zh_hans: 性能面板
zh_hant: 效能面板

# debug.plant.actionsHeader
source: Actions
ja: アクション
ko: 동작
zh_hans: 操作
zh_hant: 操作

# debug.plant.apply
source: Apply
ja: 適用
ko: 적용
zh_hans: 应用
zh_hant: 套用

# debug.plant.clear
source: Clear
ja: クリア
ko: 지우기
zh_hans: 清除
zh_hant: 清除

# debug.plant.clearAllSimulations
source: Clear all simulations
ja: すべてのシミュレーションをクリア
ko: 모든 시뮬레이션 지우기
zh_hans: 清除全部模拟
zh_hant: 清除全部模擬

# debug.plant.clearHistory
source: Clear history
ja: 履歴をクリア
ko: 기록 지우기
zh_hans: 清空历史
zh_hant: 清空歷史

# debug.plant.clearHistoryConfirm
source: Clear
ja: 消去
ko: 지우기
zh_hans: 清空
zh_hant: 清空

# debug.plant.clearHistoryConfirmMessage
source: This permanently removes all recorded stage transitions.
ja: これにより、すべての段階切り替え記録が完全に削除されます。
ko: 이 작업은 모든 단계 전환 기록을 영구적으로 삭제합니다.
zh_hans: 这将永久删除所有阶段切换记录。
zh_hant: 這會永久刪除所有階段切換記錄。

# debug.plant.clearHistoryConfirmTitle
source: Clear plant history?
ja: 植物の履歴を消去しますか？
ko: 식물 기록을 지우시겠습니까?
zh_hans: 清空植物历史？
zh_hant: 清空植物歷史？

# debug.plant.clearOverride
source: Clear Override
ja: 強制をクリア
ko: 강제 해제
zh_hans: 清除强制
zh_hant: 清除強制

# debug.plant.currentStage
source: Current stage
ja: 現在の段階
ko: 현재 단계
zh_hans: 当前阶段
zh_hant: 當前階段

# debug.plant.dangerFooter
source: These actions are irreversible in this session.
ja: 以下の操作は現在のセッション内では取り消せません。
ko: 이 동작은 현재 세션에서 되돌릴 수 없습니다.
zh_hans: 以下操作在当前会话内不可撤销。
zh_hant: 以下操作於目前工作階段內無法復原。

# debug.plant.dangerHeader
source: Danger zone
ja: デンジャーゾーン
ko: 위험 영역
zh_hans: 危险区
zh_hant: 危險區

# debug.plant.forceStage
source: Force Stage
ja: 段階を強制
ko: 단계 강제 지정
zh_hans: 强制阶段
zh_hant: 強制階段

# debug.plant.forceStageFooter
source: Tap a stage to lock the plant there. Cleared by “Clear Override” or app reinstall.
ja: 段階をタップすると植物をその段階にロックします。「強制をクリア」またはアプリの再インストールで解除されます。
ko: 단계를 탭하면 식물이 그 단계에 고정됩니다. 「강제 해제」 또는 앱 재설치로 해제할 수 있습니다.
zh_hans: 点击阶段即可把植物锁定在该阶段。点击「清除强制」或重装应用即可解除。
zh_hant: 點選階段即可把植物鎖定在該階段。點「清除強制」或重裝 App 即可解除。

# debug.plant.historyEmpty
source: No transitions yet.
ja: 切り替え履歴はまだありません。
ko: 아직 전환 기록이 없습니다.
zh_hans: 暂无切换记录。
zh_hant: 暫無切換記錄。

# debug.plant.historyHeader
source: Recent transitions
ja: 最近の切り替え
ko: 최근 전환
zh_hans: 最近切换
zh_hant: 最近切換

# debug.plant.overrideActive
source: Locked
ja: ロック中
ko: 잠김
zh_hans: 已锁定
zh_hant: 已鎖定

# debug.plant.overrideNone
source: Free
ja: 未ロック
ko: 해제됨
zh_hans: 未锁定
zh_hant: 未鎖定

# debug.plant.overrideState
source: Override
ja: 強制上書き
ko: 강제 덮어쓰기
zh_hans: 强制覆盖
zh_hant: 強制覆蓋

# debug.plant.recompute
source: Recompute stage
ja: 段階を再計算
ko: 단계 다시 계산
zh_hans: 重新计算阶段
zh_hant: 重新計算階段

# debug.plant.recordActivityGrade
source: Record activity (grade)
ja: 活動を記録（成績）
ko: 활동 기록 (성적)
zh_hans: 记录一次活动（成绩）
zh_hant: 記錄一次活動（成績）

# debug.plant.resetConfirm
source: Reset
ja: リセット
ko: 리셋
zh_hans: 重置
zh_hant: 重設

# debug.plant.resetConfirmMessage
source: This wipes current stage, history, force override and all simulations. The plant returns to seed.
ja: 現在の段階、履歴、強制上書き、すべてのシミュレーションをクリアし、植物をシード状態に戻します。
ko: 현재 단계, 기록, 강제 덮어쓰기, 모든 시뮬레이션이 삭제되고 식물이 씨앗 상태로 돌아갑니다.
zh_hans: 这将清空当前阶段、历史、强制覆盖和全部模拟,植物回到种子状态。
zh_hant: 這會清空目前階段、歷史、強制覆蓋與全部模擬,植物回到種子狀態。

# debug.plant.resetConfirmTitle
source: Reset plant?
ja: 植物をリセットしますか？
ko: 식물을 리셋하시겠습니까?
zh_hans: 重置植物？
zh_hant: 重設植物？

# debug.plant.resetToSeed
source: Reset to seed
ja: シードにリセット
ko: 씨앗으로 리셋
zh_hans: 重置为种子
zh_hant: 重設為種子

# debug.plant.simDaysSince
source: Sim days since last active
ja: 最終活動からの経過日数のシミュレート
ko: 마지막 활동 이후 경과 일수 시뮬레이션
zh_hans: 模拟距上次活跃天数
zh_hant: 模擬距上次活躍天數

# debug.plant.simStreak
source: Sim streak (days)
ja: 連続日数のシミュレート
ko: 연속 일수 시뮬레이션
zh_hans: 模拟连续天数
zh_hant: 模擬連續天數

# debug.plant.simulationActive
source: Active
ja: 有効
ko: 활성
zh_hans: 已激活
zh_hant: 已啟用

# debug.plant.simulationFooter
source: Simulated values feed PlantStage.derive as if they were the real AchievementManager snapshot. Cleared via the “Clear All Simulations” button.
ja: シミュレーション値は PlantStage.derive への入力として実 AchievementManager スナップショットの代わりに使用されます。「すべてのシミュレーションをクリア」で解除できます。
ko: 시뮬레이션 값은 실제 AchievementManager 스냅샷인 것처럼 PlantStage.derive 에 전달됩니다. 「모든 시뮬레이션 지우기」 로 해제할 수 있습니다.
zh_hans: 模拟值会当作真实的 AchievementManager 快照喂给 PlantStage.derive。可通过「清除全部模拟」解除。
zh_hant: 模擬值會當作真實的 AchievementManager 快照餵給 PlantStage.derive。可透過「清除全部模擬」解除。

# debug.plant.simulationHeader
source: Simulation
ja: シミュレーション
ko: 시뮬레이션 입력
zh_hans: 模拟输入
zh_hant: 模擬輸入

# debug.plant.simulationState
source: Simulation
ja: シミュレーション
ko: 시뮬레이션
zh_hans: 模拟
zh_hant: 模擬

# debug.plant.stateHeader
source: Current State
ja: 現在の状態
ko: 현재 상태
zh_hans: 当前状态
zh_hant: 當前狀態

# debug.plant.title
source: Plant Lab
ja: 植物ラボ
ko: 식물 연구실
zh_hans: 植物实验室
zh_hant: 植物實驗室

# debug.recomputeAchievements
source: Recompute Achievements
ja: 実績を再計算
ko: 업적 다시 계산
zh_hans: 重算成就
zh_hant: 重算成就

# debug.rescheduleNotifications
source: Reschedule All Notifications
ja: すべての通知を再スケジュール
ko: 모든 알림 다시 예약
zh_hans: 重新调度全部通知
zh_hant: 重新排程全部通知

# debug.sectionFooter
source: Toggles below require the master switch above. Changes are saved instantly and take effect on every page. Available in all builds, including App Store release.
ja: 下のサブトグルはマスター开关がオンの時のみ動作します。設定は即時保存され、すべてのページに反映されます。リリースビルドでも利用可能。
ko: 아래 하위 토글은 마스터 스위치가 켜져 있을 때만 작동합니다. 설정은 즉시 저장되며 모든 페이지에 적용됩니다. 릴리스 빌드에서도 사용 가능.
zh_hans: 下方子开关需先开启总开关。设置即时保存,对所有页面生效。Release 构建同样可用。
zh_hant: 下方子開關需先開啟總開關。設定即時儲存,對所有頁面生效。Release 建置同樣可用。

# debug.sectionTitle
source: Debug Mode
ja: Debug モード
ko: Debug 모드
zh_hans: Debug 模式
zh_hant: Debug 模式

# debug.stateAndCache
source: State & Cache
ja: 状態とキャッシュ
ko: 상태 및 캐시
zh_hans: 状态与缓存
zh_hant: 狀態與快取

# debug.verboseLogging
source: Verbose Logging
ja: Verbose ログ
ko: Verbose 로깅
zh_hans: Verbose 日志
zh_hant: Verbose 日誌

source: Declining
ja: 下降中
ko: 하락 중
zh_hans: 退步中
zh_hant: 退步中

source: Deep dive into %@
ja: %@ を深く分析
ko: %@ 심층 분석
zh_hans: 深入分析 %@
zh_hant: 深入分析 %@

source: Deep Focus
ja: ディープフォーカス
ko: 집중 학습
zh_hans: 深度学习
zh_hant: 深度學習

source: Deep Focus Day
ja: ディープフォーカスデー
ko: 집중 학습의 날
zh_hans: 深度学习日
zh_hant: 深度學習日

source: Default schedule: 1, 3, 5, 10, 30 day(s) before the exam. Edit the exam to customize.
ja: デフォルト:試験 1、3、5、10、30 日前。編集で変更できます。
ko: 기본 일정: 시험 1, 3, 5, 10, 30일 전. 편집하여 변경 가능.
zh_hans: 默认计划:考前 1、3、5、10、30 天。编辑考试以自定义。
zh_hant: 預設計劃:考前 1、3、5、10、30 天。編輯考試以自訂。

source: Delete
ja: 削除
ko: 삭제
zh_hans: 删除
zh_hant: 刪除

source: Delete All Data
ja: すべてのデータを削除
ko: 모든 데이터 삭제
zh_hans: 删除所有数据
zh_hant: 刪除所有資料

source: Delete Complete
ja: 削除完了
ko: 삭제 완료
zh_hans: 删除完成
zh_hant: 刪除完成

source: Delete Failed
ja: 削除失敗
ko: 삭제 실패
zh_hans: 删除失败
zh_hant: 刪除失敗

source: Delete routine
ja: ルーティン削除
ko: 루틴 삭제
zh_hans: 删除例程
zh_hant: 刪除例程

source: Delete this routine?
ja: このルーティンを削除しますか?
ko: 이 루틴을 삭제할까요?
zh_hans: 删除该例程?
zh_hant: 刪除該例程?

source: Details
ja: 詳細
ko: 상세
zh_hans: 详情
zh_hant: 詳情

source: Developed by
ja: 開発者
ko: 개발자
zh_hans: 开发者
zh_hant: 開發者

source: Diary Calendar
ja: 日記カレンダー
ko: 일기 캘린더
zh_hans: 日记日历
zh_hant: 日記日曆

source: Diary Content
ja: 日記の内容
ko: 일기 내용
zh_hans: 日记内容
zh_hant: 日記內容

source: Diary Settings
ja: 日記設定
ko: 일기 설정
zh_hans: 日记设置
zh_hant: 日記設定

source: Different regions and education systems have different subjects and grading scales. Includes domestic and international curricula (A-Level, IB, AP, SAT, ACT, IGCSE).
ja: 地域や教育制度によって科目や評価基準は異なります。国内および国際カリキュラム（A-Level、IB、AP、SAT、ACT、IGCSE）に対応しています。
ko: 지역과 교육 제도에 따라 과목과 평가 기준이 다릅니다. 국내 및 국제 교육 과정(A-Level, IB, AP, SAT, ACT, IGCSE)을 지원합니다.
zh_hans: 不同地区和教育体系有不同的科目和评分标准。包含国内和国际课程（A-Level、IB、AP、SAT、ACT、IGCSE）。
zh_hant: 不同地區和教育體制有不同的科目和評分標準。包含國內和國際課程（A-Level、IB、AP、SAT、ACT、IGCSE）。

source: Difficulty
ja: 難易度
ko: 난이도
zh_hans: 难度
zh_hant: 難度

source: Disable this to keep the task only inside StudyPulse. The linked Reminder, if any, will be removed.
ja: オフにすると StudyPulse 内のみで管理され、リンク済みのリマインダーは削除されます。
ko: 끄면 StudyPulse 안에서만 관리되며, 이미 연결된 리마인더는 삭제됩니다.
zh_hans: 关闭后只保留在 StudyPulse 内，已同步的提醒事项会被删除。
zh_hant: 關閉後只保留在 StudyPulse 內，已同步的提醒事項會被刪除。

source: Discard
ja: <#ja#>
ko: <#ko#>
zh_hans: 放弃
zh_hant: <#zh-Hant#>

source: Discard your drawing?
ja: <#ja#>
ko: <#ko#>
zh_hans: 放弃你的画稿？
zh_hant: <#zh-Hant#>

source: Display Name
ja: 表示名
ko: 표시 이름
zh_hans: 显示名称
zh_hant: 顯示名稱

source: Does StudyPulse sync across devices?
ja: StudyPulseは複数端末で同期できますか？
ko: StudyPulse는 기기 간 동기화를 지원하나요？
zh_hans: StudyPulse 支持跨设备同步吗？
zh_hant: StudyPulse 支援跨裝置同步嗎？

source: Domestic
ja: 国内
ko: 국내
zh_hans: 国内
zh_hant: 國內

source: Don’t break your streak — finish one of today’s goals.
ja: ストリークを途切れさせないで——今日の目標を一つ達成しましょう。
ko: 스트릭을 끊지 마세요 — 오늘 목표 하나를 달성하세요.
zh_hans: 别让你的连续打卡断掉——完成今天的一个目标吧。
zh_hant: 別讓你的連續打卡斷掉——完成今天的一個目標吧。

source: Done
ja: 完了
ko: 완료
zh_hans: 完成
zh_hant: 完成

source: Double tap to change the cache selection.
ja: ダブルタップしてキャッシュの選択状態を変更します。
ko: 이중 탭하여 캐시 선택 상태를 변경합니다.
zh_hans: 轻点两下可更改缓存选择状态。
zh_hant: 點兩下以更改快取選取狀態。

source: Draft / Answer
ja: 下書き / 解答
ko: 초안 / 답안
zh_hans: 草稿 / 作答
zh_hant: 草稿 / 作答

source: Drag with 2 fingers to pan, pinch to zoom
ja: <#ja#>
ko: <#ko#>
zh_hans: 两指拖动可平移，双指捏合可缩放
zh_hant: <#zh-Hant#>

# Draw to add an image
source: Draw on the canvas — the result will be added to the current section
ja: <#ja#>
ko: <#ko#>
zh_hans: 在画布上画图，提交后会追加到当前段
zh_hant: <#zh-Hant#>

source: Drawing
ja: <#ja#>
ko: <#ko#>
zh_hans: 绘制
zh_hant: <#zh-Hant#>

source: Due Date
ja: 締切
ko: 마감일
zh_hans: 截止日期
zh_hant: 截止日期

source: due for review
ja: 復習待ち
ko: 복습 대기
zh_hans: 待复习
zh_hant: 待複習

source: Due soon — finish the smallest complete version.
ja: 期限が近いタスクです——最小限の完了形を目指しましょう。
ko: 마감이 임박했습니다. 최소한의 완료 형태부터 끝내세요.
zh_hans: 即将到期——先完成最小可交付版本。
zh_hant: 即將到期——先完成最小可交付版本。

source: Due today
ja: 今日が期限
ko: 오늘 마감
zh_hans: 今日到期
zh_hant: 今日到期

source: Due Today
ja: 本日
ko: 오늘 마감
zh_hans: 今日到期
zh_hant: 今日到期

source: Duration
ja: 時間
ko: 소요 시간
zh_hans: 用时
zh_hant: 用時

source: Dynamic from Body Data
ja: 身体データから自動設定
ko: 신체 데이터로 동적 설정
zh_hans: 根据身体数据动态规划
zh_hant: 根據身體資料動態規劃

source: e.g. 3
ja: 例：3
ko: 예: 3
zh_hans: 例如：3
zh_hant: 例如：3

source: e.g. 130
ja: 例:130
ko: 예: 130
zh_hans: 例如 130
zh_hant: 例如 130

source: e.g. 680
ja: 例：680
ko: 예: 680
zh_hans: 例如：680
zh_hant: 例如：680

# e.g. 2026 春季学期
source: e.g. 2026 Spring Semester
ja: 例:2026 春季学期
ko: 예: 2026 봄 학기
zh_hans: 如 2026 春季学期
zh_hant: 如 2026 春季學期

source: e.g. Alex
ja: 例：Alex
ko: 예: Alex
zh_hans: 例如：小明
zh_hant: 例如：小明

source: e.g. Chen Kai
ja: 例：陈凯
ko: 예: 陈凯
zh_hans: 例如：陈凯
zh_hant: 例如：陳凱

source: e.g. Grade 11
ja: 例：高校 2 年
ko: 예: 고등학교 1학년
zh_hans: 例如：高一
zh_hant: 例如：高一

source: e.g. Peking University
ja: 例：北京大学
ko: 예: 베이징 대학
zh_hans: 例如：北京大学
zh_hant: 例如：北京大學

source: e.g. Tsinghua High School
ja: 例：清華大学附属高校
ko: 예: 칭화대 부속 고등학교
zh_hans: 例如：清华附中
zh_hant: 例如：清華附中

source: e.g. Tsinghua University
ja: 例：清華大学
ko: 예: 칭화대학교
zh_hans: 例如：清华大学
zh_hant: 例如：清華大學

source: Easy
ja: 簡単
ko: 쉬움
zh_hans: 简单
zh_hant: 簡單

source: Edit
ja: 編集
ko: 편집
zh_hans: 编辑
zh_hant: 編輯

source: Edit Avatar
ja: アバターを編集
ko: 아바타 편집
zh_hans: 编辑头像
zh_hant: 編輯頭像

source: Edit Coach Goal
ja: コーチ目標を編集
ko: 코치 목표 편집
zh_hans: 编辑教练目标
zh_hant: 編輯教練目標

source: Edit Comp Exam
ja: 総合試験を編集
ko: 종합 시험 편집
zh_hans: 编辑综合考试
zh_hant: 編輯綜合考試

source: Edit Diary Entry
ja: 日記を編集
ko: 일기 편집
zh_hans: 编辑日记
zh_hant: 編輯日記

source: Edit Exam
ja: 試験を編集
ko: 시험 편집
zh_hans: 编辑考试
zh_hant: 編輯考試

source: Edit Grade
ja: 成績を編集
ko: 성적 편집
zh_hans: 编辑成绩
zh_hant: 編輯成績

source: Edit Mistake
ja: 错题を編集
ko: 오답 편집
zh_hans: 编辑错题
zh_hant: 編輯錯題

source: Edit Phase
ja: フェーズを編集
ko: 단계 편집
zh_hans: 编辑阶段
zh_hant: 編輯階段

source: Edit Profile
ja: プロフィールを編集
ko: 프로필 편집
zh_hans: 编辑档案
zh_hant: 編輯檔案

source: Edit Review
ja: 振り返りを編集
ko: 회고 수정
zh_hans: 编辑复盘
zh_hant: 編輯復盤

source: Edit routine
ja: ルーティン編集
ko: 루틴 편집
zh_hans: 编辑例程
zh_hant: 編輯例程

source: Edit subject
ja: 科目を編集
ko: 과목 편집
zh_hans: 编辑科目
zh_hant: 編輯科目

source: Edit Subjects
ja: 科目を編集
ko: 과목 편집
zh_hans: 编辑科目
zh_hant: 編輯科目

source: Edit Task
ja: タスクを編集
ko: 작업 편집
zh_hans: 编辑任务
zh_hant: 編輯任務

source: Education Level
ja: 教育段階
ko: 교육 단계
zh_hans: 教育阶段
zh_hant: 教育階段

source: Education Stage
ja: 教育段階
ko: 교육 단계
zh_hans: 教育阶段
zh_hant: 教育階段

source: Education System
ja: 教育制度
ko: 교육 제도
zh_hans: 教育体系
zh_hant: 教育體制

source: Effortless
ja: 楽勝
ko: 쉬웠음
zh_hans: 毫不费力
zh_hant: 毫不費力

source: Elevated breathing can signal stress or illness — we'll suggest a calming activity first.
ja: 呼吸数の上昇はストレスや体調不良のサインかも——まずは落ち着いた活動を提案します。
ko: 호흡수 상승은 스트레스나体調不良의 신호일 수 있어 먼저 차분한 활동을 제안합니다.
zh_hans: 呼吸频率升高可能意味着压力或身体不适——我们会先建议舒缓的活动。
zh_hant: 呼吸頻率升高可能意味著壓力或身體不適——我們會先建議舒緩的活動。

source: Empty
ja: 空
ko: 비어있음
zh_hans: 空白
zh_hant: 空白

source: Enable Glass Effect
ja: ガラス効果を有効化
ko: 글래스 효과 활성화
zh_hans: 启用液态玻璃
zh_hant: 啟用液態玻璃

source: Enable Habit Insight
ja: 学習習慣の洞察を有効にする
ko: 학습 습관 인사이트 켜기
zh_hans: 启用习惯洞察
zh_hant: 啟用習慣洞察

source: Enable HealthKit access in Settings.
ja: 設定で HealthKit アクセスを有効にしてください。
ko: 설정에서 HealthKit 접근 권한을 활성화하세요.
zh_hans: 请在设置中开启 HealthKit 访问权限。
zh_hant: 請在設定中開啟 HealthKit 存取權限。

source: Enable HRV
ja: HRV を有効化
ko: HRV 활성화
zh_hans: 开启 HRV
zh_hant: 開啟 HRV

source: Enable iOS 26 glass effect on supported cards (requires iOS 26+). Falls back to material on older systems.
ja: 対応するカードで iOS 26 のガラス効果を有効化（iOS 26+ 必須）。古い OS ではマテリアルにフォールバックします。
ko: 지원되는 카드에서 iOS 26 글래스 효과를 활성화합니다 (iOS 26+ 필요). 하위 버전에서는 머티리얼로 대체됩니다.
zh_hans: 在支持的卡片上启用 iOS 26 液态玻璃效果（需要 iOS 26+）；低版本回退到毛玻璃。
zh_hant: 在支援的卡片上啟用 iOS 26 液態玻璃效果（需要 iOS 26+）；低版本回退到毛玻璃。

source: Enable LLM Features
ja: LLM 機能を有効化
ko: LLM 기능 활성화
zh_hans: 启用 LLM 功能
zh_hant: 啟用 LLM 功能

source: Enable Study Diary
ja: 学習日記を有効化
ko: 학습 일기 활성화
zh_hans: 启用学习日记
zh_hant: 啟用學習日記

source: Enabled
ja: 有効
ko: 활성화
zh_hans: 启用
zh_hant: 啟用

source: Encrypted backups are not supported by this version.
ja: このバージョンは暗号化バックアップに対応していません。
ko: 이 버전은 암호화된 백업을 지원하지 않습니다.
zh_hans: 此版本尚不支持加密备份。
zh_hant: 此版本尚不支援加密備份。

source: End
ja: 終了
ko: 끝
zh_hans: 结束
zh_hant: 結束

source: End Date
ja: 終了日
ko: 종료일
zh_hans: 结束日期
zh_hant: 結束日期

source: End Time
ja: 終了時間
ko: 종료 시간
zh_hans: 结束时间
zh_hant: 結束時間

source: End time must be after start time.
ja: 終了時刻は開始時刻より後にしてください。
ko: 종료 시간은 시작 시간보다 늦어야 해요.
zh_hans: 结束时间必须晚于开始时间。
zh_hant: 結束時間必須晚於開始時間。

source: Endpoint reachable, model responded.
ja: エンドポイントに到達、モデルが応答しました。
ko: 엔드포인트에 도달했고 모델이 응답했습니다.
zh_hans: 端点可达,模型已正常响应。
zh_hant: 端點可達,模型已正常回應。

source: Energetic
ja: 元気
ko: 활기참
zh_hans: 精力充沛
zh_hant: 精力充沛

source: Energy
ja: エネルギー
ko: 에너지
zh_hans: 精力
zh_hant: 精力

source: Energy Level
ja: エネルギーレベル
ko: 에너지 수준
zh_hans: 精力等级
zh_hant: 精力等級

source: Engine: %@
ja: エンジン:%@
ko: 엔진:%@
zh_hans: 引擎:%@
zh_hant: 引擎:%@

source: English
ja: 英語
ko: 영어
zh_hans: 英语
zh_hant: 英文

source: Enrollment Year
ja: 入学年度
ko: 입학 연도
zh_hans: 入学年份
zh_hant: 入學年份

source: Enter ranking
ja: 順位を入力
ko: 석차 입력
zh_hans: 输入排名
zh_hant: 輸入排名

source: entries
ja: 件
ko: 건
zh_hans: 条
zh_hant: 條

source: Error
ja: エラー
ko: 오류
zh_hans: 错误
zh_hant: 錯誤

source: Error Reason
ja: 間違いの理由
ko: 틀린 이유
zh_hans: 错误原因
zh_hant: 錯誤原因

source: EWMA + mistake exposure bivariate regression, no network required.
ja: EWMA + 間違い問題露出の二変量回帰、ネットワーク不要。
ko: EWMA + 오답 노출 이변량 회귀, 네트워크 불필요.
zh_hans: EWMA + 错题曝光二元回归,无需联网。
zh_hant: EWMA + 錯題曝光二元回歸,無需連線。

source: EWMA-weighted regression, no network required.
ja: EWMA 重み付き回帰、ネットワーク不要。
ko: EWMA 가중 회귀, 네트워크 불필요.
zh_hans: EWMA 加权回归,无需联网。
zh_hant: EWMA 加權回歸,無需連線。

source: Exam
ja: 試験
ko: 시험
zh_hans: 考试
zh_hant: 考試

source: Exam Countdown
ja: 試験カウントダウン
ko: 시험 카운트다운
zh_hans: 考试倒计时
zh_hant: 考試倒數

source: Exam Date
ja: 試験日
ko: 시험 날짜
zh_hans: 考试日期
zh_hant: 考試日期

source: Exam deadline
ja: 試験が近い
ko: 시험 임박
zh_hans: 考试临近
zh_hant: 考試臨近

source: Exam Details
ja: 試験詳細
ko: 시험 상세
zh_hans: 考试详情
zh_hant: 考試詳情

source: Exam Grade Reminder
ja: 試験成績登録のリマインダー
ko: 시험 성적 등록 알림
zh_hans: 考试登记提醒
zh_hant: 考試登記提醒

source: Exam in %d day(s); secure the essentials.
ja: %d 日後に試験；重要事項を優先しましょう。
ko: %d일 후 시험입니다. 핵심 내용을 우선하세요.
zh_hans: %d 天后考试；先掌握最关键内容。
zh_hant: %d 天後考試；先掌握最關鍵內容。

source: Exam is almost here!
ja: 試験が迫っています！
ko: 시험이 곧 다가옵니다!
zh_hans: 考试快到了！
zh_hant: 考試快到了！

source: Exam Location
ja: 試験会場
ko: 시험장 정보
zh_hans: 考场信息
zh_hant: 考場資訊

source: Exam Name
ja: 試験名
ko: 시험 이름
zh_hans: 考试名称
zh_hant: 考試名稱

source: Exam Name (e.g., Midterm)
ja: 試験名（例：中間試験）
ko: 시험 이름 (예: 중간고사)
zh_hans: 考试名称（如：期中考试）
zh_hant: 考試名稱（如：期中考）

source: Exam Numbers
ja: 試験科目数
ko: 시험 과목 수
zh_hans: 考试科目数
zh_hant: 考試科目數

source: Exam Review
ja: 振り返り
ko: 회고
zh_hans: 复盘
zh_hant: 復盤

source: Exam Type
ja: 試験タイプ
ko: 시험 유형
zh_hans: 考试类型
zh_hant: 考試類型

# exam.reverse.planner.cta
source: Start your first reverse plan
ja: 最初の逆算プランを始める
ko: 첫 역산 플랜 시작
zh_hans: 开始第一次倒推
zh_hant: 開始第一次倒推

# exam.reverse.planner.current.score
source: Current score
ja: 現在の得点
ko: 현재 점수
zh_hans: 当前分数
zh_hant: 目前分數

# exam.reverse.planner.daily.tasks
source: Daily plan
ja: 毎日の計画
ko: 일일 계획
zh_hans: 每日计划
zh_hant: 每日計畫

# exam.reverse.planner.days
source: %d days left
ja: 試験まであと %d 日
ko: 시험까지 %d일
zh_hans: 距考试 %d 天
zh_hant: 距考試 %d 天

# exam.reverse.planner.delete
source: Delete plan
ja: プランを削除
ko: 계획 삭제
zh_hans: 删除计划
zh_hant: 刪除計畫

# exam.reverse.planner.delete.message
source: This saved plan cannot be recovered.
ja: 保存したプランは復元できません。
ko: 저장한 계획은 복구할 수 없습니다.
zh_hans: 已保存的计划删除后无法恢复。
zh_hant: 已儲存的計畫刪除後無法復原。

# exam.reverse.planner.delete.title
source: Delete this plan?
ja: このプランを削除しますか？
ko: 이 계획을 삭제할까요?
zh_hans: 删除这份计划？
zh_hant: 刪除這份計畫？

# exam.reverse.planner.edit.goal
source: Edit goal
ja: 目標を編集
ko: 목표 편집
zh_hans: 编辑目标
zh_hant: 編輯目標
